using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_1210
{
    class Program
    {
        static void Main()
        {
            // Глубокое погружение в ООП ч.2
            // Ролик 1.Примеры некоторых, стандартных интерфейсов
            // Ролик 2.Индексаторы.Дополнение
            // Ролик 3.Статические члены и экземплярные члены класса, статический конструктор
            // Ролик 4.Вложенные классы
            // Ролик 5.Использование WPF при решении задач. Пример организации архитектуры приложения
            // Ролик 6.Домашнее задание

        }
    }
}
