using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_1561
{
    class Program
    {
        static void Main(string[] args)
        {
            #region 

            // Создать прототип банковской системы, позвляющей управлять клиентами и клиентскими счетами.
            // В информационной системе есть возможность перевода денежных средств между счетами пользователей
            // Открывать вклады, с капитализацией и без
            // * Продумать возможность выдачи кредитов
            // Продумать использование обобщений

            // Продемонстрировать работу созданной системы

            // Банк
            // ├── Отдел работы с обычными клиентами
            // ├── Отдел работы с VIP клиентами
            // └── Отдел работы с юридическими лицами

            // Дополнительно: клиентам с хорошей кредитной историей предлагать пониженую ставку по кредиту и 
            // повышенную ставку по вкладам
            // Добавить механизмы оповещений использую делегаты и события
            // Реализовать журнал действий, который будет хранить записи всех транзакций по 
            // счетам / вкладам / кредитам
            // 
            #endregion

            // Создать собственные исключения и добавить их обработку в предыдущий проект
            // Подумать над использованием методов-расширений и перегрузках операций
            // Вынести основную логику в отдельную(ые) библиотеку

        }
    }
}
