using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Numerics;

namespace Example_1671
{
    class Program
    {
        static void Main(string[] args)
        {
             
            #region 

            // Создать бота, позволяющего принимать разные типы файлов, 
            // *Научить бота отправлять выбранный файл в ответ
            // 
            // https://data.mos.ru/
            // https://apidata.mos.ru/
            // 
            // https://vk.com/dev
            // https://vk.com/dev/manuals

            // https://dev.twitch.tv/
            // https://discordapp.com/developers/docs/intro
            // https://discordapp.com/developers/applications/
            // https://discordapp.com/verification


            // Создать UI для бота
            // Предусмотреть возможность сохранения истории сообщений, присланных боту в JSON-файл 
            //

            #endregion

            #region 

            // Создать прототип банковской системы, позвляющей управлять клиентами и клиентскими счетами.
            // В информационной системе есть возможность перевода денежных средств между счетами пользователей
            // Открывать вклады, с капитализацией и без
            // * Продумать возможность выдачи кредитов
            // Продумать использование обобщений

            // Продемонстрировать работу созданной системы

            // Банк
            // ├── Отдел работы с обычными клиентами
            // ├── Отдел работы с VIP клиентами
            // └── Отдел работы с юридическими лицами

            // Дополнительно: клиентам с хорошей кредитной историей предлагать пониженую ставку по кредиту и 
            // повышенную ставку по вкладам
            // Добавить механизмы оповещений использую делегаты и события
            // Реализовать журнал действий, который будет хранить записи всех транзакций по 
            // счетам / вкладам / кредитам
            // 

            // Создать собственные исключения и добавить их обработку в предыдущий проект
            // Подумать над использованием методов-расширений и перегрузках операций
            // Вынести основную логику в отдельную(ые) библиотеку

            #endregion

            #region 

            // Вычислить количество чисел на промежутке 
            // от 1 000 000 000
            // до 2 000 000 000

            // в которых сумма цифр числа кратна последней цифре числа

            // Число        Сумма цифр      Последняя цифра     Кратность
            //    11                 2                    1            Да    
            //    12                 3                    2           Нет     
            //    19                10                    9           Нет      
            //    20                 2                    0            Да      
            //   123                 6                    3            Да       
            //                                                           
            // 

            #endregion

            #region *

            // Написать программу перемножения матриц используя многопоточность
            // Например матрицы размера 1000 х 2000 * 2000 х 3000

            #endregion


        }
    }
}
